In [1]:
import pandas as pd
from pandas import DataFrame

In [9]:
df = pd.read_csv('../data/nyc_taxi_2019-01.csv',
                usecols=['passenger_count', 'trip_distance', 'payment_type', 'total_amount'],
                header=0)

In [10]:
df.shape

(7667792, 4)

In [11]:
df.head()

   passenger_count  trip_distance  payment_type  total_amount
0                1            1.5             1          9.95
1                1            2.6             1         16.30
2                3            0.0             1          5.80
3                5            0.0             2          7.55
4                5            0.0             2         55.55

In [12]:
df['passenger_count'].value_counts()

passenger_count
1    5456121
2    1114106
5     323842
3     314721
6     200811
4     140753
0     117381
8         29
7         19
9          9
Name: count, dtype: int64

In [14]:
df.loc[df['passenger_count'] > 8].count()

passenger_count    9
trip_distance      9
payment_type       9
total_amount       9
dtype: int64

In [15]:
df.loc[df['passenger_count'] == 0].count()

passenger_count    117381
trip_distance      117381
payment_type       117381
total_amount       117381
dtype: int64

In [18]:
# 2 = cash, 4 = dispute, 6 = voided
df['payment_type'].value_counts()

payment_type
1    5486027
2    2137415
3      33186
4      11164
Name: count, dtype: int64

In [22]:
df.loc[(df['total_amount'] > 1000) & (df['payment_type'] == 2)]

         passenger_count  trip_distance  payment_type  total_amount
478791                 1            0.1             2       6667.45
3715690                1            0.0             2       1079.40
4300990                1           21.7             2       3345.30
5323430                1            0.0             2     356214.78
6827160                1            1.0             2       3004.80

In [26]:
df.loc[df['total_amount'] < 0, 'total_amount'].count()

7131

In [27]:
df['trip_distance'] < df['trip_distance'].mean()

0           True
1           True
2           True
3           True
4           True
           ...
7667787    False
7667788     True
7667789     True
7667790     True
7667791     True
Name: trip_distance, Length: 7667792, dtype: bool

In [28]:
df['total_amount'] > df['total_amount'].mean()

0          False
1           True
2          False
3          False
4           True
           ...
7667787     True
7667788    False
7667789    False
7667790    False
7667791    False
Name: total_amount, Length: 7667792, dtype: bool

In [42]:
df.loc[(df['trip_distance'] < df['trip_distance'].mean()) 
    & (df['total_amount'] > df['total_amount'].mean())]

         passenger_count  trip_distance  payment_type  total_amount
1                      1           2.60             1         16.30
4                      5           0.00             2         55.55
6                      5           0.00             2         55.55
10                     2           2.80             1         19.55
32                     1           1.03             2         52.80
...                  ...            ...           ...           ...
7667648                1           1.90             1         22.55
7667659                1           0.00             1         63.36
7667665                1           2.34             1         24.96
7667729                2           2.72             1         15.96
7667754                1           2.65             1         16.56

[411255 rows x 4 columns]

In [40]:
df.query('trip_distance < trip_distance.mean() & total_amount > total_amount.mean()')

         passenger_count  trip_distance  payment_type  total_amount
1                      1           2.60             1         16.30
4                      5           0.00             2         55.55
6                      5           0.00             2         55.55
10                     2           2.80             1         19.55
32                     1           1.03             2         52.80
...                  ...            ...           ...           ...
7667648                1           1.90             1         22.55
7667659                1           0.00             1         63.36
7667665                1           2.34             1         24.96
7667729                2           2.72             1         15.96
7667754                1           2.65             1         16.56

[411255 rows x 4 columns]

## How many rides that cost less than $0 involved either a dispute (payment_type of 4) or a voided trip (payment_type of 6)?

In [50]:
df.loc[(df['total_amount'] < 0) & (df['payment_type'].isin([4,6]))].count()

passenger_count    2666
trip_distance      2666
payment_type       2666
total_amount       2666
dtype: int64

In [51]:
df['payment_type'].value_counts(normalize=True)[[1,2]]

payment_type
1    0.715464
2    0.278752
Name: proportion, dtype: float64